# Pandas DataFrame Eleman İşlemleri

In [2]:
import pandas as pd
import numpy as np

In [3]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [4]:
sozluk = {"var1":s1,"var2":s2,"var3":s3}

In [5]:
sozluk

{'var1': array([1, 1, 1, 3, 8]),
 'var2': array([0, 9, 6, 4, 7]),
 'var3': array([2, 2, 2, 1, 1])}

In [6]:
df = pd.DataFrame(sozluk)

In [7]:
df

   var1  var2  var3
0     1     0     2
1     1     9     2
2     1     6     2
3     3     4     1
4     8     7     1

In [8]:
df[0:1]

   var1  var2  var3
0     1     0     2

In [9]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
df.index = ["a","b","c","d","e"]

In [11]:
df

   var1  var2  var3
a     1     0     2
b     1     9     2
c     1     6     2
d     3     4     1
e     8     7     1

In [12]:
df["c":"d"]

   var1  var2  var3
c     1     6     2
d     3     4     1

## Silme

In [13]:
df.drop("a", axis = 0)

   var1  var2  var3
b     1     9     2
c     1     6     2
d     3     4     1
e     8     7     1

In [14]:
df

   var1  var2  var3
a     1     0     2
b     1     9     2
c     1     6     2
d     3     4     1
e     8     7     1

In [15]:
df.drop("a", axis = 0, inplace = True) #df uzerinde ki degisikligi kalici yapar

In [16]:
df

   var1  var2  var3
b     1     9     2
c     1     6     2
d     3     4     1
e     8     7     1

## Fancy ile silme

In [17]:
l = ["c","e"]

In [18]:
df.drop(l, axis = 0)

   var1  var2  var3
b     1     9     2
d     3     4     1

## Degiskenlerle Çalışma

In [21]:
df

   var1  var2  var3
b     1     9     2
c     1     6     2
d     3     4     1
e     8     7     1

In [22]:
"var1" in df

True

In [23]:
l = ["var1","var4","var2"]

In [24]:
for i in l:
    print(i in df)

True
False
True

In [25]:
df

   var1  var2  var3
b     1     9     2
c     1     6     2
d     3     4     1
e     8     7     1

In [26]:
df["var4"] = df["var1"] * df["var2"] # var4 olmadigi icin yaratiyor atamamizi yapiyor

In [27]:
df

   var1  var2  var3  var4
b     1     9     2     9
c     1     6     2     6
d     3     4     1    12
e     8     7     1    56

## Degişken Silme

In [28]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     1     9     2
c     1     6     2
d     3     4     1
e     8     7     1

In [29]:
df

   var1  var2  var3  var4
b     1     9     2     9
c     1     6     2     6
d     3     4     1    12
e     8     7     1    56

In [30]:
df.drop("var4", axis = 1, inplace = True)

In [31]:
df

   var1  var2  var3
b     1     9     2
c     1     6     2
d     3     4     1
e     8     7     1

In [32]:
l = ["var1","var2"]

In [33]:
df.drop(l, axis = 1)

   var3
b     2
c     2
d     1
e     1